## PANDAS

- Pandas is a Python library used for working with data sets.
- Pandas is a fast, poweful and easy to use open source data analysis library
- It has functions for analyzing, cleaning, exploring, and manipulating data.

### Why Use Pandas?
- Pandas allows us to analyze big data and make conclusions based on statistical theories.

- Pandas can clean messy data sets, and make them readable and relevant.

- Relevant data is very important in data science.

### What Can Pandas Do?
- Pandas gives you answers about the data. Like:

- Is there a correlation between two or more columns?
- What is average value?
- Max value?
- Min value?
- Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values. This is called cleaning the data.

### Pandas is a must-learn tool for any:
- Data analyst
- Data scientist
- Python developer

### Key Data Structures in Pandas
- Series
- Data frame

#### SERIES
A one-dimensional labeled array (like a list but with index)

#### DataFrame:
- A two-dimensional table with rows and columns (like an Excel sheet).

- You can think of it as a collection of Series.

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

##### Series handles single dimenional data like lists, tuple etc

In [183]:
data = [10,20,30,40,50]
s1 = pd.Series(data)
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [185]:
print(type(s1))

<class 'pandas.core.series.Series'>

In [187]:
print(s1.values) #values attribute returns values

[10 20 30 40 50]

In [103]:
print(s1.index) #index attribute returns index,

RangeIndex(start=0, stop=5, step=1)

In [104]:
print(s1.dtype)  # this give data type of elements/data

int64

In [105]:
#benefit of series is we can provide our own index values
s1.index=[100,101,102,103,104]
print(s1)

100    10
101    20
102    30
103    40
104    50
dtype: int64

In [106]:
s1.index = ['A', 'B', 'C', 'D', 'E']
print(s1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [107]:
s1.index = range(1001,1006)
print(s1)

1001    10
1002    20
1003    30
1004    40
1005    50
dtype: int64

In [108]:
s1.index = [1.5,2.5,3.5,4.5,5.7]
print(s1)

1.5    10
2.5    20
3.5    30
4.5    40
5.7    50
dtype: int64

#### ACCESSING DATA IN SERIES
- If the index is not numerical(like a,b,c etc), then we can access data using both the ways that is by natural indexing and the  the type of index mentioned(like a["A"],a["B"] Etc.)
- if the index of data is numerical then we need to use numbers normally

In [110]:
 data = [10,20,30,40,50]
s1 = pd.Series(data)
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [111]:
s1.index = ['A', 'B', 'C', 'D', 'E']
print(s1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [112]:
s1["A"]

10

In [113]:
s1[0]  #it is as same as s1["A"]

10

In [114]:
print(s1["B"])

20

In [115]:
print(s1[1])

20

In [116]:
print(s1["E"])

50

In [117]:
data = [10,20,30,40,50]
s1 = pd.Series(data)
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [118]:
s1.index = range(1001,1006)
print(s1)

1001    10
1002    20
1003    30
1004    40
1005    50
dtype: int64

In [119]:
s1[1001]

10

In [120]:
s1[0]

KeyError: 0

##### LOC AND ILOC
- loc[] – Access by Label (Name)
  - Use Case:If the Series has labels/indexes like 'a', 'b', 'c', you use them directly with .iloc[].
- .iloc[] – Access by Position (Number
  - Even if the Series has labels, .iloc[] ignores them and just looks at the row number.

In [189]:
data = [10,20,30,40,50]
s1 = pd.Series(data)
s1.index = ['A', 'B', 'C', 'D', 'E']
print(s1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [191]:
s1.iloc[0] #by positional indexing

10

In [193]:
s1.loc["A"]  #by index that has been provided

10

In [195]:
s1.loc[["A",'B'] ]

A    10
B    20
dtype: int64

In [197]:
s1.iloc[[0,1]]

A    10
B    20
dtype: int64

### SLICING

In [200]:
data = [10,20,30,40,50]
s1 = pd.Series(data)
s1.index = ['A', 'B', 'C', 'D', 'E']
print(s1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [202]:
s1[0:3]

A    10
B    20
C    30
dtype: int64

In [204]:
s1[1:5]

B    20
C    30
D    40
E    50
dtype: int64

In [206]:
s1[::-1]

E    50
D    40
C    30
B    20
A    10
dtype: int64

### Add, update and Delete operations

In [209]:
data = [10,20,30,40,50]
s1 = pd.Series(data)
s1.index = ['A', 'B', 'C', 'D', 'E']
print(s1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [211]:
s1['F'] = 60 #updating values in series
print(s1)

A    10
B    20
C    30
D    40
E    50
F    60
dtype: int64

In [212]:
s1['D'] = 80
print(s1)

A    10
B    20
C    30
D    80
E    50
F    60
dtype: int64

In [213]:
s1["G"]=90 #adding new values
print(s1)

A    10
B    20
C    30
D    80
E    50
F    60
G    90
dtype: int64

In [214]:
s1.drop('D') # this operation is temporary
print(s1)

A    10
B    20
C    30
D    80
E    50
F    60
G    90
dtype: int64

In [215]:
s1.drop('D', inplace = True) #inplace = True. make changes permenant
print(s1)

A    10
B    20
C    30
E    50
F    60
G    90
dtype: int64

In [216]:
s2 = s1.drop('F') #s.drop('F') creates a new Series that's a copy of the original Series s1, 
                    #but without the item that has index label 'F'
print(s2)
print("----")
print("Original Series : \n",s1)

A    10
B    20
C    30
E    50
G    90
dtype: int64
----
Original Series :
 A    10
B    20
C    30
E    50
F    60
G    90
dtype: int64

### ARITHMETIC OPERATION

In [218]:
data = [10,20,30,40,50]
s1 = pd.Series(data)
s1.index = ['A', 'B', 'C', 'D', 'E']
print(s1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [219]:

s1 + 5        # Add 5 to every value

A    15
B    25
C    35
D    45
E    55
dtype: int64

In [220]:
s1 * 2        # Multiply each value by 2

A     20
B     40
C     60
D     80
E    100
dtype: int64

### Filtering / Conditions
- You can filter based on a condition:

In [222]:
s1[s1 > 20]         # Returns values greater than 20 → 30, 40

C    30
D    40
E    50
dtype: int64

In [223]:
s1[(s1 > 20) & (s1<=30)]  #here for this we can use bitwise operators

C    30
dtype: int64

### Statistical Operations

In [225]:
print("sum  is : ",s1.sum())           # Add all values
print("-----")
print("Mean  is : ",s1.mean())          # Average
print("-----")
print("Maximum value  is : ",s1.max())           # Biggest value
print("-----")
print("Minimum value  is : ",s1.min())           # Smallest value
print("-----")
print("Standard deviation",round(s1.std(),2))           # Standard deviation
print("-----")
print("Summary : \n",s1.describe())     # Summary (count, mean, std, etc.)

sum  is :  150
-----
Mean  is :  30.0
-----
Maximum value  is :  50
-----
Minimum value  is :  10
-----
Standard deviation 15.81
-----
Summary :
 count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

### CREATING SERIES FROM DICTIONARIES

In [227]:
data = {'Liyakat' : 85,
        'Maseerah' : 80,
        'Parvaiz': 86,
        'Sajid' : 81}
s1 = pd.Series(data)
s1

Liyakat     85
Maseerah    80
Parvaiz     86
Sajid       81
dtype: int64

Here keys act as indexes

In [229]:
s1["Liyakat"]

85

In [230]:
s1[0]

85

In [231]:
data = {'Srinagar' : 'Nowhatta',
        'Lalchowk' : 'Kokerbazar',
        'Sumbal': 'Bandipora',
        'Shopian' : 'Kulgam',
        'Rambagh' : 'Natipora'}
data

{'Srinagar': 'Nowhatta',
 'Lalchowk': 'Kokerbazar',
 'Sumbal': 'Bandipora',
 'Shopian': 'Kulgam',
 'Rambagh': 'Natipora'}

In [232]:
s2 = pd.Series(data)
s2

Srinagar      Nowhatta
Lalchowk    Kokerbazar
Sumbal       Bandipora
Shopian         Kulgam
Rambagh       Natipora
dtype: object

In [250]:
s2["Srinagar"]

'Nowhatta'

In [252]:
print("Indexes are : \n",s2.index)
print()
print("Values are : \n",s2.values)

Indexes are :
 Index(['Srinagar', 'Lalchowk', 'Sumbal', 'Shopian', 'Rambagh'], dtype='object')

Values are :
 ['Nowhatta' 'Kokerbazar' 'Bandipora' 'Kulgam' 'Natipora']

In [254]:
s2.loc['Shopian']  #index by label

'Kulgam'

In [255]:
s2.iloc[3]  #by position

'Kulgam'

In [256]:
# This operation assigns a name to a Pandas Series
s2.name="Different areas"

In [257]:
print(s2)

Srinagar      Nowhatta
Lalchowk    Kokerbazar
Sumbal       Bandipora
Shopian         Kulgam
Rambagh       Natipora
Name: Different areas, dtype: object

In [258]:
# This operation assigns a name to the index of a Pandas Series
s2.index.name = 'Capitals'
s2

Capitals
Srinagar      Nowhatta
Lalchowk    Kokerbazar
Sumbal       Bandipora
Shopian         Kulgam
Rambagh       Natipora
Name: Different areas, dtype: object

In [259]:
print(s2.index)
print(s2.values)
print(s2.dtype)
print(s2.name)
print(s2.index.name)

Index(['Srinagar', 'Lalchowk', 'Sumbal', 'Shopian', 'Rambagh'], dtype='object', name='Capitals')
['Nowhatta' 'Kokerbazar' 'Bandipora' 'Kulgam' 'Natipora']
object
Different areas
Capitals

In [260]:
s2[['Srinagar','Shopian','Sumbal']]

Capitals
Srinagar     Nowhatta
Shopian        Kulgam
Sumbal      Bandipora
Name: Different areas, dtype: object

In [261]:
#Creating series from already existing series
s2

Capitals
Srinagar      Nowhatta
Lalchowk    Kokerbazar
Sumbal       Bandipora
Shopian         Kulgam
Rambagh       Natipora
Name: Different areas, dtype: object

In [262]:
areas=['Srinagar','Shopian','Sumbal']
s3 = pd.Series(data=s2,index=areas)
s3

Srinagar     Nowhatta
Shopian        Kulgam
Sumbal      Bandipora
Name: Different areas, dtype: object

In [263]:
areas=['Srinagar','Shopian','Sumbal','Khanyar','Rajouri_kadal']
s3 = pd.Series(data=s2,index=areas)
s3  #it these are not present, it will be NaN(Missing or null values)

Srinagar          Nowhatta
Shopian             Kulgam
Sumbal           Bandipora
Khanyar                NaN
Rajouri_kadal          NaN
Name: Different areas, dtype: object

#### SOME FUNCTIONS IN SERIES
 `

In [265]:
s3.isnull() #checks for missing values

Srinagar         False
Shopian          False
Sumbal           False
Khanyar           True
Rajouri_kadal     True
Name: Different areas, dtype: bool

In [266]:
s3.notnull()  #opposite of isnull

Srinagar          True
Shopian           True
Sumbal            True
Khanyar          False
Rajouri_kadal    False
Name: Different areas, dtype: bool

In [267]:
s3.isnull().sum()  #it gives total number of null values

2

In [268]:
s3["Eidgah"]="Narwara"
s3

Srinagar          Nowhatta
Shopian             Kulgam
Sumbal           Bandipora
Khanyar                NaN
Rajouri_kadal          NaN
Eidgah             Narwara
Name: Different areas, dtype: object

In [269]:
 s3.head()  #it returns top five rows

Srinagar          Nowhatta
Shopian             Kulgam
Sumbal           Bandipora
Khanyar                NaN
Rajouri_kadal          NaN
Name: Different areas, dtype: object

In [270]:
s3.head(3)

Srinagar     Nowhatta
Shopian        Kulgam
Sumbal      Bandipora
Name: Different areas, dtype: object

In [271]:
s3.tail(5)  #it will return bottom five rows

Shopian             Kulgam
Sumbal           Bandipora
Khanyar                NaN
Rajouri_kadal          NaN
Eidgah             Narwara
Name: Different areas, dtype: object

In [272]:
s3.tail(3)  #it will return bottom three rows

Khanyar              NaN
Rajouri_kadal        NaN
Eidgah           Narwara
Name: Different areas, dtype: object

In [273]:
s3["Safakadal"]="Narwara"

In [274]:
s3

Srinagar          Nowhatta
Shopian             Kulgam
Sumbal           Bandipora
Khanyar                NaN
Rajouri_kadal          NaN
Eidgah             Narwara
Safakadal          Narwara
Name: Different areas, dtype: object

In [275]:
s3["Karan_nagar"]="Narwara"

In [276]:
s3

Srinagar          Nowhatta
Shopian             Kulgam
Sumbal           Bandipora
Khanyar                NaN
Rajouri_kadal          NaN
Eidgah             Narwara
Safakadal          Narwara
Karan_nagar        Narwara
Name: Different areas, dtype: object

In [277]:
s3.duplicated()                                   # Check for duplicate values

Srinagar         False
Shopian          False
Sumbal           False
Khanyar          False
Rajouri_kadal     True
Eidgah           False
Safakadal         True
Karan_nagar       True
Name: Different areas, dtype: bool

In [278]:
s3.duplicated().sum()

3

In [279]:
s3.index = range(100,108)
s3

100     Nowhatta
101       Kulgam
102    Bandipora
103          NaN
104          NaN
105      Narwara
106      Narwara
107      Narwara
Name: Different areas, dtype: object

In [280]:
s3.loc[102:105]

102    Bandipora
103          NaN
104          NaN
105      Narwara
Name: Different areas, dtype: object

## DATAFRAMES
- A DataFrame is a 2D data structure (like a table) used to store data in a tabular form — with rows and columns.
- It is part of the Pandas library in Python, which is designed for data analysis and manipulation.
- Imagine an Excel sheet — that’s what a DataFrame looks like in Python.

#### Why Use DataFrame?
- To store and organize data easily
- To filter, analyze, and transform data
- To read/write data from different file types: CSV, Excel, SQL, etc.

##### A DataFrame has 3 main parts:
- Index: Row labels (default: 0, 1, 2,...)
- Columns: Column names (like 'Name', 'Age', etc.)
- Values: Data inside (strings, numbers, dates, etc.)

In [3]:
employee1 = pd.Series({'Name' : 'Utkarsh', 'ID' : 1, 'Gender' : 'Male', 'Salary':95000})
employee2 = pd.Series({'Name' : 'Kartik', 'ID' : 2, 'Gender' : 'Male','Salary':85000})
employee3 = pd.Series({'Name' : 'Aishwarya', 'ID' : 3, 'Gender' : 'Female','Salary':75000})
employee4 = pd.Series({'Name' : 'Anand', 'ID' : 4, 'Gender' : 'Male','Salary':65000})
employee5 = pd.Series({'Name' : 'Shalini', 'ID' : 5, 'Gender' : 'Female','Salary':90000})
employee6 = pd.Series({'Name' : 'Pratik', 'ID' : 6, 'Gender' : 'Male','Salary':80000})
employee7 = pd.Series({'Name' : 'Monalika', 'ID' : 7, 'Gender' : 'Female','Salary':70000})
employee8 = pd.Series({'Name' : 'Ayesha', 'ID' : 8, 'Gender' : 'Female','Salary':60000})
employee9 = pd.Series({'Name' : 'Anant', 'ID' : 9, 'Gender' : 'Male','Salary':100000})
employee10 = pd.Series({'Name' : 'Shamiksha', 'ID' : 10, 'Gender' : 'Female','Salary':45000})
employee11 = pd.Series({'Name' : 'Prashant', 'ID' : 11, 'Gender' : 'Male','Salary':55000})
employee12 = pd.Series({'Name' : 'Mohini', 'ID' : 12, 'Gender' : 'Female','Salary':65000})

In [5]:
type(employee1)

pandas.core.series.Series

In [7]:
employees = [employee1,employee2,employee3,employee4,employee5,employee6,employee7,employee8,employee9,employee10,employee11,employee12]
df1 = pd.DataFrame(data = employees, index = range(101,113))
df1

          Name  ID  Gender  Salary
101    Utkarsh   1    Male   95000
102     Kartik   2    Male   85000
103  Aishwarya   3  Female   75000
104      Anand   4    Male   65000
105    Shalini   5  Female   90000
106     Pratik   6    Male   80000
107   Monalika   7  Female   70000
108     Ayesha   8  Female   60000
109      Anant   9    Male  100000
110  Shamiksha  10  Female   45000
111   Prashant  11    Male   55000
112     Mohini  12  Female   65000

In [9]:
df1.head()

          Name  ID  Gender  Salary
101    Utkarsh   1    Male   95000
102     Kartik   2    Male   85000
103  Aishwarya   3  Female   75000
104      Anand   4    Male   65000
105    Shalini   5  Female   90000

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 101 to 112
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    12 non-null     object
 1   ID      12 non-null     int64
 2   Gender  12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [13]:
df1.index

RangeIndex(start=101, stop=113, step=1)

In [15]:
df1.values

array([['Utkarsh', 1, 'Male', 95000],
       ['Kartik', 2, 'Male', 85000],
       ['Aishwarya', 3, 'Female', 75000],
       ['Anand', 4, 'Male', 65000],
       ['Shalini', 5, 'Female', 90000],
       ['Pratik', 6, 'Male', 80000],
       ['Monalika', 7, 'Female', 70000],
       ['Ayesha', 8, 'Female', 60000],
       ['Anant', 9, 'Male', 100000],
       ['Shamiksha', 10, 'Female', 45000],
       ['Prashant', 11, 'Male', 55000],
       ['Mohini', 12, 'Female', 65000]], dtype=object)

In [17]:
df1.columns

Index(['Name', 'ID', 'Gender', 'Salary'], dtype='object')

In [19]:
df1.name = 'Employee_Details'
df1.index.name = 'Employee_ID'

In [21]:
df1.name

'Employee_Details'

In [23]:
df1.index.name

'Employee_ID'

In [25]:
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107           Monalika   7  Female   70000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 101 to 112
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    12 non-null     object
 1   ID      12 non-null     int64
 2   Gender  12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

## Accessing data from DataFrame

#### Access Single Column (returns a Series)
- df['column_name']
- df.column_name  ( works only if column name has no spaces or special chars)

In [31]:
df1['Name']  #accessing columns

Employee_ID
101      Utkarsh
102       Kartik
103    Aishwarya
104        Anand
105      Shalini
106       Pratik
107     Monalika
108       Ayesha
109        Anant
110    Shamiksha
111     Prashant
112       Mohini
Name: Name, dtype: object

In [33]:
df1.Salary

Employee_ID
101     95000
102     85000
103     75000
104     65000
105     90000
106     80000
107     70000
108     60000
109    100000
110     45000
111     55000
112     65000
Name: Salary, dtype: int64

In [35]:
df1.Gender

Employee_ID
101      Male
102      Male
103    Female
104      Male
105    Female
106      Male
107    Female
108    Female
109      Male
110    Female
111      Male
112    Female
Name: Gender, dtype: object

### Accessing multiple columns

In [38]:
df1[['Name', 'Salary']]  #This will return dataframe

                  Name  Salary
Employee_ID
101            Utkarsh   95000
102             Kartik   85000
103          Aishwarya   75000
104              Anand   65000
105            Shalini   90000
106             Pratik   80000
107           Monalika   70000
108             Ayesha   60000
109              Anant  100000
110          Shamiksha   45000
111           Prashant   55000
112             Mohini   65000

### Accessing Rows
- Using loc[] – by label/index
- Using iloc[] – by position

In [41]:
df1.loc[102]

Name      Kartik
ID             2
Gender      Male
Salary     85000
Name: 102, dtype: object

In [43]:
df1.loc[101]#by label/index

Name      Utkarsh
ID              1
Gender       Male
Salary      95000
Name: 101, dtype: object

In [45]:
df1.iloc[0]  #by position

Name      Utkarsh
ID              1
Gender       Male
Salary      95000
Name: 101, dtype: object

In [47]:
df1.loc[[101,105,109]]

                Name  ID  Gender  Salary
Employee_ID
101          Utkarsh   1    Male   95000
105          Shalini   5  Female   90000
109            Anant   9    Male  100000

In [49]:
df1.iloc[[0,4,6,9]]

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
105            Shalini   5  Female   90000
107           Monalika   7  Female   70000
110          Shamiksha  10  Female   45000

## Accessing Specific Values

In [52]:
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107           Monalika   7  Female   70000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000

In [54]:
df1.loc[105]["Name"]  # value at row index 105, column "Name"

'Shalini'

In [56]:
df1.loc[105]["Salary"]

90000

In [58]:
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107           Monalika   7  Female   70000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000

In [60]:
df1.iloc[4,1] # value at row 4, column 1 (second column)

5

In [62]:
df1.iloc[4]["Name"] # value at row 4, column 1 (second column)

'Shalini'

In [64]:
df1['Name'][103]

'Aishwarya'

In [66]:
df1.Name[103]

'Aishwarya'

In [68]:
df1.loc[[101,105,108]]['Salary']

Employee_ID
101    95000
105    90000
108    60000
Name: Salary, dtype: int64

In [70]:
df1.loc[[101,105,108,110]][['Name', 'Salary']]

                  Name  Salary
Employee_ID
101            Utkarsh   95000
105            Shalini   90000
108             Ayesha   60000
110          Shamiksha   45000

In [72]:
df1.loc[[105,108,110, 101], ['Name','Salary']]

                  Name  Salary
Employee_ID
105            Shalini   90000
108             Ayesha   60000
110          Shamiksha   45000
101            Utkarsh   95000

In [74]:
df1.loc[101:106]  # rows from index 101 to 106 (like list slicing)

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000

In [76]:
df1.iloc[0:6]

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000

## Adding and Deleting Rows and Columns

In [79]:
# Add Row (Basic)
df1.loc[107] = ['David', 28, 'Male',87000]
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107              David  28    Male   87000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000

In [81]:
df1.loc[113] = ['Priti', 13, 'Female', 71000]
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107              David  28    Male   87000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000
113              Priti  13  Female   71000

In [83]:
df1['Age'] = np.random.randint(25,50,13)   #ADDING COLUMN
df1

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   35
102             Kartik   2    Male   85000   26
103          Aishwarya   3  Female   75000   30
104              Anand   4    Male   65000   47
105            Shalini   5  Female   90000   33
106             Pratik   6    Male   80000   33
107              David  28    Male   87000   45
108             Ayesha   8  Female   60000   42
109              Anant   9    Male  100000   31
110          Shamiksha  10  Female   45000   47
111           Prashant  11    Male   55000   43
112             Mohini  12  Female   65000   27
113              Priti  13  Female   71000   29

In [85]:
df1['City'] = "Kashmir"

In [87]:
df1

                  Name  ID  Gender  Salary  Age     City
Employee_ID
101            Utkarsh   1    Male   95000   35  Kashmir
102             Kartik   2    Male   85000   26  Kashmir
103          Aishwarya   3  Female   75000   30  Kashmir
104              Anand   4    Male   65000   47  Kashmir
105            Shalini   5  Female   90000   33  Kashmir
106             Pratik   6    Male   80000   33  Kashmir
107              David  28    Male   87000   45  Kashmir
108             Ayesha   8  Female   60000   42  Kashmir
109              Anant   9    Male  100000   31  Kashmir
110          Shamiksha  10  Female   45000   47  Kashmir
111           Prashant  11    Male   55000   43  Kashmir
112             Mohini  12  Female   65000   27  Kashmir
113              Priti  13  Female   71000   29  Kashmir

##### DELETING ROWS AND COLUMS IN DATAFRAME

In [90]:
#deleting t columns in dataframe 
df1.drop('City', inplace = True, axis = 1)   #here axis=1 means column
df1

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   35
102             Kartik   2    Male   85000   26
103          Aishwarya   3  Female   75000   30
104              Anand   4    Male   65000   47
105            Shalini   5  Female   90000   33
106             Pratik   6    Male   80000   33
107              David  28    Male   87000   45
108             Ayesha   8  Female   60000   42
109              Anant   9    Male  100000   31
110          Shamiksha  10  Female   45000   47
111           Prashant  11    Male   55000   43
112             Mohini  12  Female   65000   27
113              Priti  13  Female   71000   29

## Querying Based on Condition
- Querying means filtering rows in a DataFrame based on some condition(s).

In [93]:
df1[df1.Age > 40]

                  Name  ID  Gender  Salary  Age
Employee_ID
104              Anand   4    Male   65000   47
107              David  28    Male   87000   45
108             Ayesha   8  Female   60000   42
110          Shamiksha  10  Female   45000   47
111           Prashant  11    Male   55000   43

In [95]:
df1[df1['Salary'] < 70000]

                  Name  ID  Gender  Salary  Age
Employee_ID
104              Anand   4    Male   65000   47
108             Ayesha   8  Female   60000   42
110          Shamiksha  10  Female   45000   47
111           Prashant  11    Male   55000   43
112             Mohini  12  Female   65000   27

In [97]:
df1[df1.Salary < 70000][['Name', 'Salary']]

                  Name  Salary
Employee_ID
104              Anand   65000
108             Ayesha   60000
110          Shamiksha   45000
111           Prashant   55000
112             Mohini   65000

In [99]:
df1[df1.Gender == 'Male']

                 Name  ID Gender  Salary  Age
Employee_ID
101           Utkarsh   1   Male   95000   35
102            Kartik   2   Male   85000   26
104             Anand   4   Male   65000   47
106            Pratik   6   Male   80000   33
107             David  28   Male   87000   45
109             Anant   9   Male  100000   31
111          Prashant  11   Male   55000   43

In [101]:
df1[df1.Gender == 'Male'][df1.Salary > 80000]

                Name  ID Gender  Salary  Age
Employee_ID
101          Utkarsh   1   Male   95000   35
102           Kartik   2   Male   85000   26
107            David  28   Male   87000   45
109            Anant   9   Male  100000   31

In [103]:
df1[df1.Gender == 'Female'][df1.Salary < 100000]

                  Name  ID  Gender  Salary  Age
Employee_ID
103          Aishwarya   3  Female   75000   30
105            Shalini   5  Female   90000   33
108             Ayesha   8  Female   60000   42
110          Shamiksha  10  Female   45000   47
112             Mohini  12  Female   65000   27
113              Priti  13  Female   71000   29

In [105]:
df1[df1.Gender == 'Male'][df1.Salary > 60000][df1.Salary < 120000]

                Name  ID Gender  Salary  Age
Employee_ID
101          Utkarsh   1   Male   95000   35
102           Kartik   2   Male   85000   26
104            Anand   4   Male   65000   47
106           Pratik   6   Male   80000   33
107            David  28   Male   87000   45
109            Anant   9   Male  100000   31

In [107]:
df1[df1.Gender == 'Female'][df1.Age > 45]

                  Name  ID  Gender  Salary  Age
Employee_ID
110          Shamiksha  10  Female   45000   47

In [109]:
# Extract name, gender and salary or all male employees having salary between 80000 to 120000
df1[df1.Gender == 'Male'][df1.Salary >= 80000][df1.Salary <= 120000][['Name', 'Gender', 'Salary']]

                Name Gender  Salary
Employee_ID
101          Utkarsh   Male   95000
102           Kartik   Male   85000
106           Pratik   Male   80000
107            David   Male   87000
109            Anant   Male  100000

## .query() Method in Pandas
- The .query() method is used to filter rows from a DataFrame using a query string, just like writing a sentence in English or SQL.
- It is a cleaner and more readable alternative to writing long conditions using brackets and boolean operators.
- Syntax is : DataFrame.query("condition")

In [112]:
df1.query('Salary > 70000')

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   35
102             Kartik   2    Male   85000   26
103          Aishwarya   3  Female   75000   30
105            Shalini   5  Female   90000   33
106             Pratik   6    Male   80000   33
107              David  28    Male   87000   45
109              Anant   9    Male  100000   31
113              Priti  13  Female   71000   29

In [114]:
df1.query('Gender == "Male"')

                 Name  ID Gender  Salary  Age
Employee_ID
101           Utkarsh   1   Male   95000   35
102            Kartik   2   Male   85000   26
104             Anand   4   Male   65000   47
106            Pratik   6   Male   80000   33
107             David  28   Male   87000   45
109             Anant   9   Male  100000   31
111          Prashant  11   Male   55000   43

In [116]:
df1.query('Salary > 70000 and Age > 40')

              Name  ID Gender  Salary  Age
Employee_ID
107          David  28   Male   87000   45

In [118]:
df1.query('Salary >= 70000 and Salary <= 90000')

                  Name  ID  Gender  Salary  Age
Employee_ID
102             Kartik   2    Male   85000   26
103          Aishwarya   3  Female   75000   30
105            Shalini   5  Female   90000   33
106             Pratik   6    Male   80000   33
107              David  28    Male   87000   45
113              Priti  13  Female   71000   29

In [120]:
df1.query("Gender == 'Male' and Salary >= 80000 and Salary <= 120000")[['Name', 'Gender', 'Salary']]

                Name Gender  Salary
Employee_ID
101          Utkarsh   Male   95000
102           Kartik   Male   85000
106           Pratik   Male   80000
107            David   Male   87000
109            Anant   Male  100000

## IMPORTANT FUNCTIONS IN PANDAS

In [123]:
df1

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   35
102             Kartik   2    Male   85000   26
103          Aishwarya   3  Female   75000   30
104              Anand   4    Male   65000   47
105            Shalini   5  Female   90000   33
106             Pratik   6    Male   80000   33
107              David  28    Male   87000   45
108             Ayesha   8  Female   60000   42
109              Anant   9    Male  100000   31
110          Shamiksha  10  Female   45000   47
111           Prashant  11    Male   55000   43
112             Mohini  12  Female   65000   27
113              Priti  13  Female   71000   29

In [125]:
df1.loc[113] = df1.loc[109]
df1.loc[114] = df1.loc[110]
df1.loc[115] = ['Kavita', 15, np.nan, 85000, 30]
df1.loc[116] = ['Pratik', 16, np.nan, np.nan, 32]
df1

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   35
102             Kartik   2    Male   85000.0   26
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
105            Shalini   5  Female   90000.0   33
106             Pratik   6    Male   80000.0   33
107              David  28    Male   87000.0   45
108             Ayesha   8  Female   60000.0   42
109              Anant   9    Male  100000.0   31
110          Shamiksha  10  Female   45000.0   47
111           Prashant  11    Male   55000.0   43
112             Mohini  12  Female   65000.0   27
113              Anant   9    Male  100000.0   31
114          Shamiksha  10  Female   45000.0   47
115             Kavita  15     NaN   85000.0   30
116             Pratik  16     NaN       NaN   32

In [127]:
df1.head()

                  Name  ID  Gender   Salary  Age
Employee_ID
101            Utkarsh   1    Male  95000.0   35
102             Kartik   2    Male  85000.0   26
103          Aishwarya   3  Female  75000.0   30
104              Anand   4    Male  65000.0   47
105            Shalini   5  Female  90000.0   33

In [129]:
df1.head(10)

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   35
102             Kartik   2    Male   85000.0   26
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
105            Shalini   5  Female   90000.0   33
106             Pratik   6    Male   80000.0   33
107              David  28    Male   87000.0   45
108             Ayesha   8  Female   60000.0   42
109              Anant   9    Male  100000.0   31
110          Shamiksha  10  Female   45000.0   47

In [131]:
df1.tail()

                  Name  ID  Gender    Salary  Age
Employee_ID
112             Mohini  12  Female   65000.0   27
113              Anant   9    Male  100000.0   31
114          Shamiksha  10  Female   45000.0   47
115             Kavita  15     NaN   85000.0   30
116             Pratik  16     NaN       NaN   32

### Handling Missing Data

In [134]:
df1.isnull().sum()

Name      0
ID        0
Gender    2
Salary    1
Age       0
dtype: int64

In [136]:
df1.isna().sum()

Name      0
ID        0
Gender    2
Salary    1
Age       0
dtype: int64

In [138]:
# Check for duplicates
df1.duplicated().sum()

2

####  Dropping duplicate values

In [141]:
# To drop duplicate records
df1.drop_duplicates(inplace = True)
df1

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   35
102             Kartik   2    Male   85000.0   26
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
105            Shalini   5  Female   90000.0   33
106             Pratik   6    Male   80000.0   33
107              David  28    Male   87000.0   45
108             Ayesha   8  Female   60000.0   42
109              Anant   9    Male  100000.0   31
110          Shamiksha  10  Female   45000.0   47
111           Prashant  11    Male   55000.0   43
112             Mohini  12  Female   65000.0   27
115             Kavita  15     NaN   85000.0   30
116             Pratik  16     NaN       NaN   32

#### checking unique values

In [144]:
df1.nunique()  #nunique give number of unique values

Name      13
ID        14
Gender     2
Salary    11
Age       11
dtype: int64

In [146]:
df1['Salary'].nunique()

11

In [148]:
df1['Name'].nunique()

13

In [150]:
df1['Name'].unique()    #unique  give uniques values

array(['Utkarsh', 'Kartik', 'Aishwarya', 'Anand', 'Shalini', 'Pratik',
       'David', 'Ayesha', 'Anant', 'Shamiksha', 'Prashant', 'Mohini',
       'Kavita'], dtype=object)

In [152]:
df1['Gender'].unique()

array(['Male', 'Female', nan], dtype=object)

In [154]:
df1['Gender'].dropna().unique()  #dropping nan values

array(['Male', 'Female'], dtype=object)

In [156]:
df1.sort_index()  # indexing sort

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   35
102             Kartik   2    Male   85000.0   26
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
105            Shalini   5  Female   90000.0   33
106             Pratik   6    Male   80000.0   33
107              David  28    Male   87000.0   45
108             Ayesha   8  Female   60000.0   42
109              Anant   9    Male  100000.0   31
110          Shamiksha  10  Female   45000.0   47
111           Prashant  11    Male   55000.0   43
112             Mohini  12  Female   65000.0   27
115             Kavita  15     NaN   85000.0   30
116             Pratik  16     NaN       NaN   32

In [158]:
df1.sort_index(ascending = False)

                  Name  ID  Gender    Salary  Age
Employee_ID
116             Pratik  16     NaN       NaN   32
115             Kavita  15     NaN   85000.0   30
112             Mohini  12  Female   65000.0   27
111           Prashant  11    Male   55000.0   43
110          Shamiksha  10  Female   45000.0   47
109              Anant   9    Male  100000.0   31
108             Ayesha   8  Female   60000.0   42
107              David  28    Male   87000.0   45
106             Pratik   6    Male   80000.0   33
105            Shalini   5  Female   90000.0   33
104              Anand   4    Male   65000.0   47
103          Aishwarya   3  Female   75000.0   30
102             Kartik   2    Male   85000.0   26
101            Utkarsh   1    Male   95000.0   35

In [160]:
df1.sort_values(by = 'Salary')

                  Name  ID  Gender    Salary  Age
Employee_ID
110          Shamiksha  10  Female   45000.0   47
111           Prashant  11    Male   55000.0   43
108             Ayesha   8  Female   60000.0   42
104              Anand   4    Male   65000.0   47
112             Mohini  12  Female   65000.0   27
103          Aishwarya   3  Female   75000.0   30
106             Pratik   6    Male   80000.0   33
102             Kartik   2    Male   85000.0   26
115             Kavita  15     NaN   85000.0   30
107              David  28    Male   87000.0   45
105            Shalini   5  Female   90000.0   33
101            Utkarsh   1    Male   95000.0   35
109              Anant   9    Male  100000.0   31
116             Pratik  16     NaN       NaN   32

In [162]:
df1.sort_values(by = 'Salary', ascending = False)

                  Name  ID  Gender    Salary  Age
Employee_ID
109              Anant   9    Male  100000.0   31
101            Utkarsh   1    Male   95000.0   35
105            Shalini   5  Female   90000.0   33
107              David  28    Male   87000.0   45
102             Kartik   2    Male   85000.0   26
115             Kavita  15     NaN   85000.0   30
106             Pratik   6    Male   80000.0   33
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
112             Mohini  12  Female   65000.0   27
108             Ayesha   8  Female   60000.0   42
111           Prashant  11    Male   55000.0   43
110          Shamiksha  10  Female   45000.0   47
116             Pratik  16     NaN       NaN   32

In [164]:
df1.sort_values(by = 'Name')

                  Name  ID  Gender    Salary  Age
Employee_ID
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
109              Anant   9    Male  100000.0   31
108             Ayesha   8  Female   60000.0   42
107              David  28    Male   87000.0   45
102             Kartik   2    Male   85000.0   26
115             Kavita  15     NaN   85000.0   30
112             Mohini  12  Female   65000.0   27
111           Prashant  11    Male   55000.0   43
106             Pratik   6    Male   80000.0   33
116             Pratik  16     NaN       NaN   32
105            Shalini   5  Female   90000.0   33
110          Shamiksha  10  Female   45000.0   47
101            Utkarsh   1    Male   95000.0   35

In [166]:
df1.sort_values(by = ['Age', 'Salary'])   #be default sort will be based on age,
#if two rows have same age, then sort will be done on the bases on salary,
#if if salary of two rows are also same, then they will appear in the order they are present

                  Name  ID  Gender    Salary  Age
Employee_ID
102             Kartik   2    Male   85000.0   26
112             Mohini  12  Female   65000.0   27
103          Aishwarya   3  Female   75000.0   30
115             Kavita  15     NaN   85000.0   30
109              Anant   9    Male  100000.0   31
116             Pratik  16     NaN       NaN   32
106             Pratik   6    Male   80000.0   33
105            Shalini   5  Female   90000.0   33
101            Utkarsh   1    Male   95000.0   35
108             Ayesha   8  Female   60000.0   42
111           Prashant  11    Male   55000.0   43
107              David  28    Male   87000.0   45
110          Shamiksha  10  Female   45000.0   47
104              Anand   4    Male   65000.0   47

#### VALUE COUNTS:
- Counts the frequency of unique values in a Series (a single column).

In [177]:
df1.Salary.value_counts()

Salary
85000.0     2
65000.0     2
95000.0     1
75000.0     1
90000.0     1
80000.0     1
87000.0     1
60000.0     1
100000.0    1
45000.0     1
55000.0     1
Name: count, dtype: int64

In [179]:
df1.Gender.value_counts()

Gender
Male      7
Female    5
Name: count, dtype: int64

In [187]:
df1.Gender.value_counts(normalize = True)  #df1.Gender.value_counts(normalize = True)

Gender
Male      0.583333
Female    0.416667
Name: proportion, dtype: float64

#### Describe
- In the Pandas library, the describe() method provides a quick statistical summary of a DataFrame or Series

In [191]:
df1.describe()

              ID         Salary        Age
count  14.000000      13.000000  14.000000
mean    9.285714   75923.076923  35.785714
std     7.119081   16665.640994   7.443930
min     1.000000   45000.000000  26.000000
25%     4.250000   65000.000000  30.250000
50%     8.500000   80000.000000  33.000000
75%    11.750000   87000.000000  42.750000
max    28.000000  100000.000000  47.000000

In [193]:
df1[['Age','Salary']].describe()

             Age         Salary
count  14.000000      13.000000
mean   35.785714   75923.076923
std     7.443930   16665.640994
min    26.000000   45000.000000
25%    30.250000   65000.000000
50%    33.000000   80000.000000
75%    42.750000   87000.000000
max    47.000000  100000.000000

In [199]:
df1.count()

Name      14
ID        14
Gender    12
Salary    13
Age       14
dtype: int64

In [203]:
df1['Salary'].mean()        # df1.Salary.mean()

75923.07692307692

In [205]:
df1['Age'].mean()

35.785714285714285

In [211]:
df1.Salary.var()
# On average, how far are the salaries from the mean — in a squared way?

277743589.7435897

In [213]:
df1.Salary.std()
# It tells you that the salaries in your DataFrame 
# deviate from the average salary by around ₹16,665 on average.

16665.640994080895

In [215]:
df1['Age'].mode()

0    30
1    33
2    47
Name: Age, dtype: int64

In [217]:
df1.Age.value_counts()

Age
30    2
47    2
33    2
35    1
26    1
45    1
42    1
31    1
43    1
27    1
32    1
Name: count, dtype: int64

In [219]:
df1.Age.quantile(0.25)
# It means that 25%
# of the people in the Age column are aged 30.25 or younger.

30.25

In [221]:
df1.Age.quantile(0.5)

33.0

In [223]:
df1.Age.quantile(0.75)

42.75

In [225]:
df1['Salary'].apply(np.sqrt)

Employee_ID
101    308.220700
102    291.547595
103    273.861279
104    254.950976
105    300.000000
106    282.842712
107    294.957624
108    244.948974
109    316.227766
110    212.132034
111    234.520788
112    254.950976
115    291.547595
116           NaN
Name: Salary, dtype: float64

In [227]:
# Normally we use lamda expressions in this
# This increases each salary by 10%.
df1['Salary'].apply(lambda num : 1.1 * num)

Employee_ID
101    104500.0
102     93500.0
103     82500.0
104     71500.0
105     99000.0
106     88000.0
107     95700.0
108     66000.0
109    110000.0
110     49500.0
111     60500.0
112     71500.0
115     93500.0
116         NaN
Name: Salary, dtype: float64

### GROUP BY
- It’s like saying:
  - "Group the data by this column, then do something to each group."
- Split data into groups based on one or more columns
- Its Syntax is : df.groupby('column_name').function()

In [232]:
df1.groupby(by = 'Gender')['Age'].mean()
# It groups your DataFrame (df1) by the 'Gender' column, 
# and then calculates the average (mean) age for each gender group.

Gender
Female    35.800000
Male      37.142857
Name: Age, dtype: float64

In [234]:
df1.groupby(by = 'Gender')['Salary'].mean()

Gender
Female    67000.0
Male      81000.0
Name: Salary, dtype: float64

### Coorelation
- Correlation measures how two columns (variables) are related to each other.

- Values range from -1 to 1:

  - +1 → Perfect positive correlation

  - 0 → No correlation

  - -1 → Perfect negative correlation

In [247]:
df1[["Age","Salary","ID"]].corr()

             Age    Salary        ID
Age     1.000000 -0.546664  0.261071
Salary -0.546664  1.000000 -0.034518
ID      0.261071 -0.034518  1.000000

## Concatenation in Pandas
- Concatenation means joining two or more DataFrames together — either:

- Vertically (row-wise, one below the other)

- Horizontally (column-wise, side by side)

- Row-wise Concatenation (axis=0)

- Column-wise Concatenation (axis=1)

In [253]:
pd.concat([df1,df1],axis = 0)

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   35
102             Kartik   2    Male   85000.0   26
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
105            Shalini   5  Female   90000.0   33
106             Pratik   6    Male   80000.0   33
107              David  28    Male   87000.0   45
108             Ayesha   8  Female   60000.0   42
109              Anant   9    Male  100000.0   31
110          Shamiksha  10  Female   45000.0   47
111           Prashant  11    Male   55000.0   43
112             Mohini  12  Female   65000.0   27
115             Kavita  15     NaN   85000.0   30
116             Pratik  16     NaN       NaN   32
101            Utkarsh   1    Male   95000.0   35
102             Kartik   2    Male   85000.0   26
103          Aishwarya   3  Female   75000.0   30
104              Anand   4    Male   65000.0   47
105            Shalini   5  Female   90000.0   33
106             Pratik   6    Male   80000.0   33
107              David  28    Male   87000.0   45
108             Ayesha   8  Female   60000.0   42
109              Anant   9    Male  100000.0   31
110          Shamiksha  10  Female   45000.0   47
111           Prashant  11    Male   55000.0   43
112             Mohini  12  Female   65000.0   27
115             Kavita  15     NaN   85000.0   30
116             Pratik  16     NaN       NaN   32

In [255]:
pd.concat([df1,df1],axis = 0,ignore_index=True)  #along rows

         Name  ID  Gender    Salary  Age
0     Utkarsh   1    Male   95000.0   35
1      Kartik   2    Male   85000.0   26
2   Aishwarya   3  Female   75000.0   30
3       Anand   4    Male   65000.0   47
4     Shalini   5  Female   90000.0   33
5      Pratik   6    Male   80000.0   33
6       David  28    Male   87000.0   45
7      Ayesha   8  Female   60000.0   42
8       Anant   9    Male  100000.0   31
9   Shamiksha  10  Female   45000.0   47
10   Prashant  11    Male   55000.0   43
11     Mohini  12  Female   65000.0   27
12     Kavita  15     NaN   85000.0   30
13     Pratik  16     NaN       NaN   32
14    Utkarsh   1    Male   95000.0   35
15     Kartik   2    Male   85000.0   26
16  Aishwarya   3  Female   75000.0   30
17      Anand   4    Male   65000.0   47
18    Shalini   5  Female   90000.0   33
19     Pratik   6    Male   80000.0   33
20      David  28    Male   87000.0   45
21     Ayesha   8  Female   60000.0   42
22      Anant   9    Male  100000.0   31
23  Shamiksha  10  Female   45000.0   47
24   Prashant  11    Male   55000.0   43
25     Mohini  12  Female   65000.0   27
26     Kavita  15     NaN   85000.0   30
27     Pratik  16     NaN       NaN   32

In [257]:
pd.concat([df1,df1], axis = 1)  #along columns

,Name,ID,Gender,Salary,Age,Name,ID,Gender,Salary,Age
Employee_ID,,,,,,,,,,
101,Utkarsh,1,Male,95000.0,35,Utkarsh,1,Male,95000.0,35
102,Kartik,2,Male,85000.0,26,Kartik,2,Male,85000.0,26
103,Aishwarya,3,Female,75000.0,30,Aishwarya,3,Female,75000.0,30
104,Anand,4,Male,65000.0,47,Anand,4,Male,65000.0,47
105,Shalini,5,Female,90000.0,33,Shalini,5,Female,90000.0,33
106,Pratik,6,Male,80000.0,33,Pratik,6,Male,80000.0,33
107,David,28,Male,87000.0,45,David,28,Male,87000.0,45
108,Ayesha,8,Female,60000.0,42,Ayesha,8,Female,60000.0,42
109,Anant,9,Male,100000.0,31,Anant,9,Male,100000.0,31
110,Shamiksha,10,Female,45000.0,47,Shamiksha,10,Female,45000.0,47
111,Prashant,11,Male,55000.0,43,Prashant,11,Male,55000.0,43
112,Mohini,12,Female,65000.0,27,Mohini,12,Female,65000.0,27
115,Kavita,15,NaN,85000.0,30,Kavita,15,NaN,85000.0,30
116,Pratik,16,NaN,NaN,32,Pratik,16,NaN,NaN,32